In [23]:
import sqlite3 as sql

In [24]:
conn = sql.connect('indira.db')

In [25]:
cursor = conn.cursor()

In [26]:
cursor.execute('''
create table if not exists students(id integer primary key,
    name text not null,
    age integer not null)
''')

In [27]:
def show_tables():
    cursor.execute(''' select name from sqlite_master where type="table" ''')
    return cursor.fetchall()

print(show_tables())

[('students',)]

In [28]:
cursor.execute(''' insert into students values(100, "Alice", 22) ''')

IntegrityError: UNIQUE constraint failed: students.id

In [11]:
def show_records(table_name):
    cursor.execute(''' select * from {} '''.format(table_name))
    return cursor.fetchall()

print(show_records('students'))

[(100, 'Alice', 22)]

In [12]:
_id = 101
_name = 'Bob'
_age = 23

cursor.execute('''insert into students values(?, ?, ?)''', (_id, _name, _age))

In [29]:
print(show_records('students'))

[(100, 'Alice', 22), (101, 'Bob', 23), (103, 'Charles', 21), (104, 'David', 20), (105, 'Eugene', 24)]

In [14]:
students = [(103, "Charles", 21), (104, "David", 20), (105, "Eugene", 24)]

cursor.executemany(''' insert into students values(?, ?, ?) ''', students)

In [30]:
print(show_records('students'))

[(100, 'Alice', 22), (101, 'Bob', 23), (103, 'Charles', 21), (104, 'David', 20), (105, 'Eugene', 24)]

In [31]:
cursor.execute(''' update students set name = "Eklavya" where id = 105 ''')

In [32]:
print(show_records('students'))

[(100, 'Alice', 22), (101, 'Bob', 23), (103, 'Charles', 21), (104, 'David', 20), (105, 'Eklavya', 24)]

In [33]:
cursor.execute(''' select name, age from students''')

In [34]:
cursor.fetchone()

('Alice', 22)

In [35]:
cursor.fetchone()

('Bob', 23)

In [36]:
cursor.fetchone()

('Charles', 21)

In [37]:
cursor.fetchone()

('David', 20)

In [38]:
cursor.fetchone()

('Eklavya', 24)

In [39]:
cursor.fetchone()

In [40]:
cursor.execute(''' select name, age from students''')

In [41]:
cursor.fetchall()

[('Alice', 22), ('Bob', 23), ('Charles', 21), ('David', 20), ('Eklavya', 24)]

In [42]:
print(show_records('students'))

[(100, 'Alice', 22), (101, 'Bob', 23), (103, 'Charles', 21), (104, 'David', 20), (105, 'Eklavya', 24)]

In [43]:
cursor.execute(''' delete from students where id = 100 ''')

In [44]:
print(show_records('students'))

[(101, 'Bob', 23), (103, 'Charles', 21), (104, 'David', 20), (105, 'Eklavya', 24)]

In [45]:
conn.commit()

In [46]:
conn.close()

## sql to pandas

In [54]:
import pandas as pd
import numpy as np

In [48]:
conn = sql.connect("indira.db")

In [50]:
cursor = conn.cursor()

In [52]:
data = pd.read_sql_query(" select * from students ", con=conn)

In [53]:
data

    id     name  age
0  101      Bob   23
1  103  Charles   21
2  104    David   20
3  105  Eklavya   24

In [60]:
data1 = pd.DataFrame(np.random.randint(2, 15, (5,3)), columns=['A','B','C']) 
data1

    A  B   C
0   2  7   5
1  13  7   2
2   3  4   9
3   8  3  11
4   9  4   8

In [61]:
data1.to_sql("Random", con=conn)

In [62]:
print(show_tables())

[('students',), ('Random',)]